Revit 2027 API
ArgumentException.ParamName Property
Gets the name of the parameter that causes this exception.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ParamName { get; }
Public ReadOnly Property ParamName As String
	Get
public:
property String^ ParamName {
	String^ get ();
}
member ParamName : string with get
Property Value
String
See Also
Reference
ArgumentException Class
Autodesk.Revit.Exceptions Namespace